Ran Plan for 2 projects:

1. dir: `DynamoDb` workspace: `default`
1. dir: `.` workspace: `default`

### 1. dir: `DynamoDb` workspace: `default`
**Plan Error**
```
running "/usr/bin/terraform plan -input=false -refresh -no-color -out \"/home/adamlj/.atlantis/repos/AdamLJohnson/IaCPlayground/2/default/DynamoDb/default.tfplan\"" in "/home/adamlj/.atlantis/repos/AdamLJohnson/IaCPlayground/2/default/DynamoDb": exit status 1

Error: Missing required argument

The argument "region" is required, but was not set.


```

---
### 2. dir: `.` workspace: `default`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # module.apigw.aws_api_gateway_deployment.devDeployment will be created
+ resource "aws_api_gateway_deployment" "devDeployment" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "dev"
      + triggers      = (known after apply)
    }

  # module.apigw.aws_api_gateway_integration.userPutItem will be created
+ resource "aws_api_gateway_integration" "userPutItem" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + credentials             = (known after apply)
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + request_templates       = {
          + "application/json" = jsonencode(
                {
                  + Item      = {
                      + FirstName = {
                          + S = "$input.path('$.FirstName')"
                        }
                      + LastName  = {
                          + S = "$input.path('$.LastName')"
                        }
                      + UserId    = {
                          + N = "$input.path('$.UserId')"
                        }
                    }
                  + TableName = "UserInfo"
                }
            )
        }
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS"
      + uri                     = "arn:aws:apigateway:us-east-1:dynamodb:action/PutItem"
    }

  # module.apigw.aws_api_gateway_integration_response.MyDemoIntegrationResponse200 will be created
+ resource "aws_api_gateway_integration_response" "MyDemoIntegrationResponse200" {
      + http_method = "POST"
      + id          = (known after apply)
      + resource_id = (known after apply)
      + rest_api_id = (known after apply)
      + status_code = "200"
    }

  # module.apigw.aws_api_gateway_integration_response.MyDemoIntegrationResponse400 will be created
+ resource "aws_api_gateway_integration_response" "MyDemoIntegrationResponse400" {
      + http_method       = "POST"
      + id                = (known after apply)
      + resource_id       = (known after apply)
      + rest_api_id       = (known after apply)
      + selection_pattern = "4\\d{2}"
      + status_code       = "400"
    }

  # module.apigw.aws_api_gateway_method.userPost will be created
+ resource "aws_api_gateway_method" "userPost" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.apigw.aws_api_gateway_method_response.response_200 will be created
+ resource "aws_api_gateway_method_response" "response_200" {
      + http_method = "POST"
      + id          = (known after apply)
      + resource_id = (known after apply)
      + rest_api_id = (known after apply)
      + status_code = "200"
    }

  # module.apigw.aws_api_gateway_method_response.response_400 will be created
+ resource "aws_api_gateway_method_response" "response_400" {
      + http_method = "POST"
      + id          = (known after apply)
      + resource_id = (known after apply)
      + rest_api_id = (known after apply)
      + status_code = "400"
    }

  # module.apigw.aws_api_gateway_resource.userResource will be created
+ resource "aws_api_gateway_resource" "userResource" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "user"
      + rest_api_id = (known after apply)
    }

  # module.apigw.aws_api_gateway_rest_api.api will be created
+ resource "aws_api_gateway_rest_api" "api" {
      + api_key_source           = "HEADER"
      + arn                      = (known after apply)
      + created_date             = (known after apply)
      + execution_arn            = (known after apply)
      + id                       = (known after apply)
      + minimum_compression_size = -1
      + name                     = "userInfoApi"
      + root_resource_id         = (known after apply)

      + endpoint_configuration {
          + types = [
              + "REGIONAL",
            ]
        }
    }

  # module.apigw.aws_api_gateway_stage.prodStage will be created
+ resource "aws_api_gateway_stage" "prodStage" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "prod"
    }

  # module.dynamo.aws_dynamodb_table.testatlantis will be created
+ resource "aws_dynamodb_table" "testatlantis" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "UserId"
      + id               = (known after apply)
      + name             = "testatlantis"
      + read_capacity    = 5
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + write_capacity   = 5

      + attribute {
          + name = "UserId"
          + type = "N"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }
    }

  # module.dynamo.aws_dynamodb_table.userinfo-table will be created
+ resource "aws_dynamodb_table" "userinfo-table" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "UserId"
      + id               = (known after apply)
      + name             = "UserInfo"
      + read_capacity    = 5
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + write_capacity   = 5

      + attribute {
          + name = "UserId"
          + type = "N"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }
    }

  # module.iam.data.aws_iam_policy_document.dynamodb_api will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "dynamodb_api"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.iam.aws_iam_role.dynamodb_api will be created
+ resource "aws_iam_role" "dynamodb_api" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "apigateway.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "api-ddb"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.iam.aws_iam_role_policy.dynamodb_api will be created
+ resource "aws_iam_role_policy" "dynamodb_api" {
      + id     = (known after apply)
      + name   = "DynamoDB-api"
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # module.apigw.module.userId.aws_api_gateway_integration.userIdGetItem will be created
+ resource "aws_api_gateway_integration" "userIdGetItem" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + credentials             = (known after apply)
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + request_templates       = {
          + "application/json" = jsonencode(
                {
                  + Key       = {
                      + UserId = {
                          + N = "$input.params('userid')"
                        }
                    }
                  + TableName = "UserInfo"
                }
            )
        }
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS"
      + uri                     = "arn:aws:apigateway:us-east-1:dynamodb:action/GetItem"
    }

  # module.apigw.module.userId.aws_api_gateway_integration_response.userIdGetItemIntegrationResponse200 will be created
+ resource "aws_api_gateway_integration_response" "userIdGetItemIntegrationResponse200" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = <<-EOT
                #if($input.body == "{}")
                  {}
                #else
                  #set($inputRoot = $input.path('$').Item)
                  {
                    "UserId": $inputRoot.UserId.N,
                    "FirstName": $inputRoot.FirstName.S,
                    "LastName": $inputRoot.LastName.S
                  }
                #end
            EOT
        }
      + rest_api_id        = (known after apply)
      + status_code        = "200"
    }

  # module.apigw.module.userId.aws_api_gateway_integration_response.userIdGetItemIntegrationResponse400 will be created
+ resource "aws_api_gateway_integration_response" "userIdGetItemIntegrationResponse400" {
      + http_method       = "GET"
      + id                = (known after apply)
      + resource_id       = (known after apply)
      + rest_api_id       = (known after apply)
      + selection_pattern = "4\\d{2}"
      + status_code       = "400"
    }

  # module.apigw.module.userId.aws_api_gateway_method.userIdGet will be created
+ resource "aws_api_gateway_method" "userIdGet" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.apigw.module.userId.aws_api_gateway_method_response.userIdresponse_200 will be created
+ resource "aws_api_gateway_method_response" "userIdresponse_200" {
      + http_method = "GET"
      + id          = (known after apply)
      + resource_id = (known after apply)
      + rest_api_id = (known after apply)
      + status_code = "200"
    }

  # module.apigw.module.userId.aws_api_gateway_method_response.userIdresponse_400 will be created
+ resource "aws_api_gateway_method_response" "userIdresponse_400" {
      + http_method = "GET"
      + id          = (known after apply)
      + resource_id = (known after apply)
      + rest_api_id = (known after apply)
      + status_code = "400"
    }

  # module.apigw.module.userId.aws_api_gateway_resource.userIdResource will be created
+ resource "aws_api_gateway_resource" "userIdResource" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{userid}"
      + rest_api_id = (known after apply)
    }

Plan: 21 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ prod_stage_url = (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](https://d825045df227.ngrok.io/lock?id=AdamLJohnson%252FIaCPlayground%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
